vedaserve/archive/prototypes/proofler-community-demo/app/controllers/constraints_controller.rb

INSERT INTO "constraints" ("created_at", "decision_id", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 24 Mar 2014 17:41:59 UTC +00:00], ["decision_id", 1], ["title", "max 50km von Hamburg"], ["updated_at", Mon, 24 Mar 2014 17:41:59 UTC +00:00]]
---
  def create
    @constraint = Constraint.new(constraint_params)

    respond_to do |format|
      if @constraint.save