vedaserve/archive/prototypes/proofler-community-demo/app/controllers/decisions_controller.rb

  def index
    @decisions = Decision.all
---
SELECT "decisions".* FROM "decisions"

  def create
    @decision = Decision.new(decision_params)

    respond_to do |format|
      if @decision.save
---
INSERT INTO "decisions" ("constrains", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["constrains", "12"], ["created_at", Thu, 20 Mar 2014 18:47:49 UTC +00:00], ["description", "12"], ["title", "12"], ["updated_at", Thu, 20 Mar 2014 18:47:49 UTC +00:00]]

  def update
    respond_to do |format|
      if @decision.update(decision_params)
---
UPDATE "decisions" SET "description" = ?, "constrains" = ?, "title" = ?, "updated_at" = ? WHERE "decisions"."id" = 1  [["description", "Ich muss ein Altenheim finden"], ["constrains", "50km rund um Hamburg"], ["title", "In welches Heim schicke ich meine Oma?"], ["updated_at", Mon, 24 Mar 2014 17:35:14 UTC +00:00]]

    def set_decision
      @decision = Decision.find(params[:id])
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT 1  [["id", "1"]]