vedaserve/archive/prototypes/proofler-community-demo/app/controllers/documents_controller.rb

  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "123"], ["created_at", Thu, 20 Mar 2014 19:08:22 UTC +00:00], ["title", "123"], ["updated_at", Thu, 20 Mar 2014 19:08:22 UTC +00:00]]

  def update
    respond_to do |format|
      if @document.update(document_params)
---
UPDATE "documents" SET "title" = ?, "content" = ?, "user_id" = ?, "updated_at" = ? WHERE "documents"."id" = 1  [["title", "Marktrecherche für ein Kaffee in Altona"], ["content", "... Text ... Lorem Ipsum ..."], ["user_id", 1], ["updated_at", Mon, 24 Mar 2014 17:37:33 UTC +00:00]]