vedaserve/archive/prototypes/proofler-community-demo/app/controllers/sources_controller.rb

SELECT "sources".* FROM "sources"
---
  def index
    @sources = Source.all

INSERT INTO "sources" ("created_at", "decision_id", "title", "type", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 24 Mar 2014 18:21:46 UTC +00:00], ["decision_id", 3], ["title", "google"], ["type", "link"], ["updated_at", Mon, 24 Mar 2014 18:21:46 UTC +00:00]]
---
  def create
    @source = Source.new(source_params)

    respond_to do |format|
      if @source.save

SELECT "sources".* FROM "sources" WHERE "sources"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_source
      @source = Source.find(params[:id])