vedaserve/archive/prototypes/proofler-community-demo/app/controllers/static_pages_controller.rb

  def search
    @decisions = Decision.all
    @documents = Document.all
---
SELECT "decisions".* FROM "decisions"
SELECT "documents".* FROM "documents"